{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/spruce/spruce.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Jul 2021, 12:13:36
{txt}
{com}. //_1
. display c(current_date)
{res}27 Jul 2021
{txt}
{com}. //_2
. display c(current_time)
{res}12:13:36
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}.         
. use spruce.dta, clear
{txt}
{com}. //_4q
. label variable Tree "Tree number"
{txt}
{com}.     
. label variable Competition "C (competition), CR (competition removed)"
{txt}
{com}.     
. label variable Fertilizer "F (fertilized), NF (not fertilized)"
{txt}
{com}.     
. label variable Height0 "Height (cm) of seedling at planting"
{txt}
{com}.     
. label variable Height5 "Height (cm) of seedling at year 5"
{txt}
{com}.     
. label variable Diameter0 "Diameter (cm) of seedling at planting"
{txt}
{com}.         
. label variable Diameter5 "Diameter (cm) of seedling at year 5"
{txt}
{com}.     
. label variable Ht_change "Change (cm) in height"
{txt}
{com}.     
. label variable Di_change "Change (cm) in diameter"    
{txt}
{com}. //_5
. describe    

{txt}Contains data from {res}spruce.dta
{txt} Observations:{res}            72                  
{txt}    Variables:{res}             9                  26 Apr 2020 12:18
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:Tree           }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Tree number{p_end}
{p 0 48}{bind:Competition    }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{txt}Competition{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}C (competition), CR (competition removed){p_end}
{p 0 48}{bind:Fertilizer     }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{txt}Fertilizer{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}F (fertilized), NF (not fertilized){p_end}
{p 0 48}{bind:Height0        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Height (cm) of seedling at planting{p_end}
{p 0 48}{bind:Height5        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Height (cm) of seedling at year 5{p_end}
{p 0 48}{bind:Diameter0      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Diameter (cm) of seedling at planting{p_end}
{p 0 48}{bind:Diameter5      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Diameter (cm) of seedling at year 5{p_end}
{p 0 48}{bind:Ht_change      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Change (cm) in height{p_end}
{p 0 48}{bind:Di_change      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Change (cm) in diameter{p_end}
{txt}{hline}
Sorted by: 

{com}. //_6q
. 
. /*
> label define fertilizer 1 "Fertilizer" 2 "No Fertilizer"
>     
> label values Fertilizer fertilizer
>     
> dotplot Height5, over(Fertilizer) ///
> title("Tree Height by Fertilizer") ///
> xtitle("Fertilizer") xlabel("none") ///
> ytitle("Tree Height At Year 5") ///
> msymbol(none) mlabel(mylabel) ///
> scheme(michigan)
> */
.     
. * generate mylabel = "ðŸŒ²"
.     
. twoway (scatter Height5 Fertilizer if Fertilizer == 1) ///
> (scatter Height5 Fertilizer if Fertilizer == 2), ///
> title("Tree Height by Fertilizer") ///
> xtitle("Fertilizer") xlabel("none") ///
> ytitle("Tree Height At Year 5") ///
> legend(order(1 "Fertilizer" 2 "No Fertilizer")) ///
> scheme(michigan)
{res}{txt}
{com}.     
. quietly: graph export myscatter.png, width(500) replace
{txt}
{com}. 
. //_7
. ttest Height5, by(Fertilizer)

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. err.{col 47}Std. dev.{col 59}[95% conf. interval]
{hline 9}{c +}{hline 68}
       F {c |}{res}{col 12}     36{col 22} 52.89167{col 34} 1.396079{col 46} 8.376476{col 58} 50.05747{col 70} 55.72586
      {txt}NF {c |}{res}{col 12}     36{col 22} 38.11944{col 34} 1.465226{col 46} 8.791354{col 58} 35.14488{col 70} 41.09401
{txt}{hline 9}{c +}{hline 68}
Combined {c |}{res}{col 12}     72{col 22} 45.50556{col 34} 1.333392{col 46} 11.31421{col 58} 42.84685{col 70} 48.16426
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22} 14.77222{col 34} 2.023839{col 58}  10.7358{col 70} 18.80864
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}F{txt}) - mean({res}NF{txt})                                     t = {res}  7.2991
{txt}H0: diff = 0                                     Degrees of freedom = {res}      70

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000
{txt}
{com}. //_8
. display %5.2f r(mu_2)-r(mu_1)
{res}-14.77
{txt}
{com}. //_9
. regress Height5 Fertilizer Height0 Competition

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        72
{txt}{hline 13}{c +}{hline 34}   F(3, 68)        = {res}    50.97
{txt}       Model {c |} {res} 6291.23189         3   2097.0773   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2797.56589        68  41.1406748   {txt}R-squared       ={res}    0.6922
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6786
{txt}       Total {c |} {res} 9088.79778        71  128.011236   {txt}Root MSE        =   {res} 6.4141

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     Height5{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}Fertilizer {c |}{col 14}{res}{space 2}-14.71947{col 26}{space 2} 1.511991{col 37}{space 1}   -9.74{col 46}{space 3}0.000{col 54}{space 4}-17.73661{col 67}{space 3}-11.70234
{txt}{space 5}Height0 {c |}{col 14}{res}{space 2} .8631456{col 26}{space 2}  .374817{col 37}{space 1}    2.30{col 46}{space 3}0.024{col 54}{space 4}   .11521{col 67}{space 3} 1.611081
{txt}{space 1}Competition {c |}{col 14}{res}{space 2} 10.52346{col 26}{space 2}  1.52143{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4}  7.48749{col 67}{space 3} 13.55942
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 39.22163{col 26}{space 2} 6.189971{col 37}{space 1}    6.34{col 46}{space 3}0.000{col 54}{space 4} 26.86974{col 67}{space 3} 51.57353
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_10
. display %5.2f _b[Fertilizer]
{res}-14.72
{txt}
{com}. //_11
. teffects psmatch (Height5) (Fertilizer Height0 Competition)
{res}
{txt}Treatment-effects estimation{col 48}Number of obs {col 67}= {res}        72
{txt:Estimator}{col 16}:{res: propensity-score matching}{col 48}{txt:Matches: requested }{col 67}{txt:=}          1
{txt:Outcome model}{col 16}:{res: matching}{txt}{col 63}min {col 67}= {res}         1
{txt:Treatment model}{col 16}:{res: logit}{col 63}{txt:max }{col 67}{txt:=}          3
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}   AI robust
{col 1}     Height5{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE          {txt}{c |}
{space 2}Fertilizer {c |}
{space 2}(NF vs F)  {c |}{col 14}{res}{space 2}-12.71019{col 26}{space 2} 1.988531{col 37}{space 1}   -6.39{col 46}{space 3}0.000{col 54}{space 4}-16.60763{col 67}{space 3}-8.812737
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_12q
. matrix b = e(b) // get matrix of coefficients
{txt}
{com}. //_13
. display %5.2f b[1,1]
{res}-12.71
{txt}
{com}. //_14
. tebalance density, ///
> scheme(michigan)
{txt}(refitting the model using the {bf:generate()} option)
{res}{txt}
{com}. 
. graph export mydensity.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/spruce/mydensity.png{rm}
saved as
PNG
format
{p_end}

{com}. //_15q
. 
. /*
> recode Fertilizer (2=1)(1=0), generate(F) // recode as 1/0
>     
> logit F Height0 Competition // logit model of propensity score
>     
> predict pscore // predict propensity score
>     
> twoway (kdensity pscore if F == 1) /// 
> (kdensity pscore if F == 0), ///
> title("Assessing Balance of Propensity Score") ///
> xtitle("Propensity Score") ///
> ytitle("Density") /// 
> legend(order(1 "Fertilizer" 2 "No Fertilizer")) ///
> scheme(michigan)
> */
. 
. //_16q
. 
. /*
> * alternative syntax with psmatch2
> 
> psmatch2 F Height0 Competition, out(Height5) n(2) com
> 
> pstest, both
> */
. 
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/spruce/spruce.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 Jul 2021, 12:13:44
{txt}{.-}
{smcl}
{txt}{sf}{ul off}